In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

import getpass

In [2]:
password = getpass.getpass()

········

In [6]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/bank'
engine = create_engine(connection_string)

In [20]:
query = '''SELECT title, length, length AS 'rank_length' 
FROM sakila.film
HAVING (rank_length IS NOT NULL)  AND (rank_length != 0)
ORDER BY rank_length desc;'''

data = pd.read_sql_query(query, engine)
data.head()

            title  length  rank_length
0   CHICAGO NORTH     185          185
1  CONTROL ANTHEM     185          185
2  DARN FORRESTER     185          185
3     GANGS PRIDE     185          185
4       HOME PITY     185          185